import './styles/App.css'

function Activity() {
  return (
    <>
      <div className="offer">
        <div className="offer_wrapper">
          <div className="offer_text">
            <h1>Вместе с нами металлургия<br />становится безупречной!</h1>
            <div className="offer_list">
              <div className="el">
                <img src="./img/offer1.png" alt="offer_img" />
                <div className="el_text">Повышение качества продукции</div>
              </div>
              <div className="el">
                <img src="./img/offer2.png" alt="offer_img" />
                <div className="el_text">Внедрение экологически чистых технологий</div>
              </div>
              <div className="el">
                <img src="./img/offer3.png" alt="offer_img" />
                <div className="el_text">Увеличение производственных мощностей</div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div className="main_activity">
        <div className="title">Деятельность компании</div>
        <div className="activity">
          <div className="text_material">Металлургический комбинат, является крупным предприятием, специализирующимся на производстве различных металлических изделий. Он способен предложить широкий ассортимент товаров, включающих трубы и трубки из металла, арматуру для строительства, каркасы и металлические конструкции для строительства, а также катушки проволоки из металла.
            Производство труб и трубок из металла является одним из основных направлений деятельности комбината.<br /> Эти изделия широко используются в различных отраслях промышленности, включая нефтегазовую, химическую, энергетическую и строительную. Трубы и трубки комбината отличаются высоким качеством, прочностью и надежностью, что позволяет им применяться в самых требовательных условиях.
            Арматура, производимая комбинатом, является неотъемлемой частью строительных работ. Она применяется для армирования бетонных конструкций, обеспечивая им дополнительную прочность и устойчивость. Арматура, выпускаемая комбинатом, отвечает высоким стандартам качества и надежности.
            Каркасы и металлические конструкции, производимые металлургическим комбинатом, используются в строительстве различных объектов: зданий, мостов, трубопроводов и других инфраструктурных систем. Комбинат предлагает широкий спектр металлических конструкций, которые отвечают требованиям прочности и долговечности.
            <br />Кроме того, металлургический комбинат занимается производством катушек проволоки из металла. Эти изделия широко применяются в различных отраслях, включая электротехнику, строительство, автомобилестроение и промышленность. Катушки проволоки, выпускаемые комбинатом, отличаются высокой прочностью и устойчивостью к коррозии.
            Металлургический комбинат, специализирующийся на производстве труб и трубок из металла, арматуры для строительства, каркасов и металлических конструкций, а также катушек проволоки, является надежным поставщиком качественных металлических изделий для различных отраслей промышленности и строительства. Его продукция отвечает высоким стандартам качества, а богатый опыт и технологические возможности комбината позволяют удовлетворить потребности самых требовательных заказчиков.</div>
          <div className="image_activity"></div>
        </div>
      </div>

    </>
  )
}

export default Activity 